---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength
source: html/b4fee8c1-b79c-e246-9ff5-b1b54fa2056d.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintChordLength

A constraint that can be applied to a RebarShapeDefinitionByArc
 and drives the straight distance between the arc endpoints.

## Syntax (C#)
```csharp
public class RebarShapeConstraintChordLength : RebarShapeConstraint
```